<a href="https://colab.research.google.com/github/pawanGithub10/MachineLearning/blob/main/PandasFinance.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.array([[10,11],[20,21]]),columns=['a','b'],index = ['r1','r2'])
df

     a   b
r1  10  11
r2  20  21

In [3]:
df.index

Index(['r1', 'r2'], dtype='object')

In [4]:
df.values

array([[10, 11],
       [20, 21]])

In [5]:
sp500 = pd.read_csv('/content/drive/My Drive/Academics/Research/Finance/Chapter1/sp500.csv',index_col = 'Symbol',usecols=[0,2,3,7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [6]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE', 'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

In [7]:
sp500.iloc[:,[1,2]].head(3)

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954

In [8]:
sp500.iloc[:,[1]].head(3)

         Price
Symbol
MMM     141.14
ABT      39.60
ABBV     53.95

In [9]:
sp500['Price']

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

In [10]:
sp500[['Price','Sector']]

         Price                  Sector
Symbol
MMM     141.14             Industrials
ABT      39.60             Health Care
ABBV     53.95             Health Care
ACN      79.79  Information Technology
ACE     102.91              Financials
...        ...                     ...
YHOO     35.02  Information Technology
YUM      74.77  Consumer Discretionary
ZMH     101.84             Health Care
ZION     28.43              Financials
ZTS      30.53             Health Care

[500 rows x 2 columns]

In [11]:
sp500.Price

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

In [12]:
sp500[:3]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [13]:
sp500['XYL':'YUM']

                        Sector  Price  Book Value
Symbol
XYL                Industrials  38.42      12.127
YHOO    Information Technology  35.02      12.768
YUM     Consumer Discretionary  74.77       5.147

In [14]:
sp500.loc['MMM']

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [15]:
sp500.loc[['MMM','ADBE']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ADBE    Information Technology   64.30      13.262

In [16]:
sp500.iloc[[0,2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954

In [18]:
i1 = sp500.index.get_loc('MMM')
i2 = sp500.index.get_loc('A')
i1,i2

(0, 10)

In [19]:
sp500.iloc[[i1,i2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
A       Health Care   56.18      16.928

In [24]:
sp500.at['MMM','Price']

141.14

In [25]:
sp500.iat[0,1]

141.14

In [26]:
sp500.Price<100

Symbol
MMM     False
ABT      True
ABBV     True
ACN      True
ACE     False
        ...
YHOO     True
YUM      True
ZMH     False
ZION     True
ZTS      True
Name: Price, Length: 500, dtype: bool

In [28]:
sp500[sp500.Price<100]

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326
ADBE    Information Technology  64.30      13.262
AES                  Utilities  13.61       5.781
...                        ...    ...         ...
XYL                Industrials  38.42      12.127
YHOO    Information Technology  35.02      12.768
YUM     Consumer Discretionary  74.77       5.147
ZION                Financials  28.43      30.191
ZTS                Health Care  30.53       2.150

[407 rows x 3 columns]

In [38]:
sp500[(sp500.Price<500) & (sp500.Sector=="Information Technology")]['Price']

Symbol
ACN      79.79
ADBE     64.30
AKAM     53.65
ADS     248.88
ALTR     33.31
         ...
WDC      84.83
WU       15.77
XRX      12.06
XLNX     46.03
YHOO     35.02
Name: Price, Length: 62, dtype: float64

In [39]:
#Arithmatic Opeations over the dataframe 
df = pd.DataFrame(np.random.randn(3,2),columns=['A','B'])
df

          A         B
0  0.243831  0.475153
1  1.350976  0.271407
2  0.888972  0.081289

In [40]:
df*2

          A         B
0  0.487662  0.950306
1  2.701951  0.542813
2  1.777943  0.162579

In [41]:
df*df

          A         B
0  0.059454  0.225770
1  1.825135  0.073662
2  0.790271  0.006608

In [43]:
df-df.iloc[2,0]

          A         B
0 -0.645141 -0.413819
1  0.462004 -0.617565
2  0.000000 -0.807682

In [44]:
df-df.iloc[2,1]

          A         B
0  0.162542  0.393864
1  1.269686  0.190117
2  0.807682  0.000000

In [47]:
subframe = df[1:2][['A','B']]
subframe

          A         B
1  1.350976  0.271407

In [48]:
df-subframe

     A    B
0  NaN  NaN
1  0.0  0.0
2  NaN  NaN

In [50]:
a_col = df['A']
a_col

0    0.243831
1    1.350976
2    0.888972
Name: A, dtype: float64

In [53]:
df.sub(a_col,axis=0)

     A         B
0  0.0  0.231322
1  0.0 -1.079569
2  0.0 -0.807682

In [56]:
s1 = pd.DataFrame([2,3,4],index = [0,1,2])
s2 = pd.DataFrame([2,3,4],index = ['0','1','2'])

In [57]:
s1+s2

    0
0 NaN
1 NaN
2 NaN
0 NaN
1 NaN
2 NaN